In [12]:
from sqlalchemy import create_engine
import pymysql

db_connection_str = 'mysql://root:@localhost/db'
db_connection = create_engine(db_connection_str)

df = pd.read_sql('SELECT * FROM try', con=db_connection)

In [13]:
df

           Nome  Sobrenome  Idade
0    Guilherme      Thomaz     15
1   Andre Filho    Schmidt     21
2  Paulo Júnior    Gearhdt     53
3         Julia      Maria     25
4         Flora      Maria      4
5        Miguel      Souza      8
6       Augusto     Seixas     33
7          Nome  Sobrenome      0
8          Nome  Sobrenome      0